# AllModelImage Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AllModelImage Property
ParameterTypeId Class See Also
---
"Image"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AllModelImage { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AllModelImage As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AllModelImage {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace